In [2]:
import sqlite3

In [11]:
db=sqlite3.connect('student_database_new.db')

In [12]:
cur=db.cursor()

In [9]:
cur.execute("CREATE TABLE scores(gender TEXT,id INT PRIMARY KEY,marKs INT)")

OperationalError: table scores already exists

In [13]:
results=cur.execute("select * from student")
for i in results:
    print(i)

OperationalError: no such table: student

In [16]:
results=cur.execute("select avg(marks)from student ")
results.fetchone()

OperationalError: no such table: student

In [6]:
results=cur.execute("select sum(marks)from student ")
results.fetchone()

(604,)

In [7]:
results=cur.execute("select * from student where marks between 65 and 85")
for i in results:
    print(i)

In [18]:
results=cur.execute("select * from student where marks is null")
for i in results:
    print(i)

In [19]:
results=cur.execute("select * from student where marks is not null")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)
(4, 'dor', 45)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [20]:
results=cur.execute("select * from student where name like 'd%'")
for i in results:
    print(i)

(4, 'dor', 45)

In [21]:
results=cur.execute("select * from student where name like '_i%'")
for i in results:
    print(i)

(9, 'kia', 23)

In [22]:
results=cur.execute("select * from student where name like '%r'")
for i in results:
    print(i)

(4, 'dor', 45)

In [23]:
results=cur.execute("select * from student where name like '%r%'")
for i in results:
    print(i)

(3, 'andrew', 110)
(4, 'dor', 45)
(5, 'surt', 55)

In [24]:
results=cur.execute("select * from student where name like '___'")
for i in results:
    print(i)

(4, 'dor', 45)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [8]:
results=cur.execute("select * from student where marks NOT in(70)")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)
(4, 'dor', 45)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [26]:
results=cur.execute("select * from student where name NOT in('dor')")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

update the record

In [9]:
sql="update student set marks=81 where id=4"
cur.execute(sql)

In [10]:
results=cur.execute("select * from student where id=4")
for i in results:
    print(i)

(4, 'dor', 81)

In [29]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)
(4, 'dor', 81)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [11]:
sql="update student set marks=105 where id in (2,3)"
cur.execute(sql)

In [12]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 105)
(3, 'andrew', 105)
(4, 'dor', 81)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [13]:
sql="delete from  student where id=4"
cur.execute(sql)

In [14]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 105)
(3, 'andrew', 105)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [34]:
sql='drop table student'
result=cur.execute(sql)